Revit 2027 API
BuiltInFailures.FamilyFailures.FailedToSetParameters Property
 Failed to apply family parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToSetParameters { get; }
Public Shared ReadOnly Property FailedToSetParameters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToSetParameters {
	FailureDefinitionId^ get ();
}
static member FailedToSetParameters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace